app/controllers/rules_controller.rb

SELECT * FROM "rules" WHERE ("rules"."id" = 980190962)
---
  def show
    @rule = Rule.find(params[:id])

SELECT * FROM "rules" WHERE ("rules"."id" = 980190962)
---
  def destroy
    @rule = Rule.find(params[:id])